DataProcessors/TG_НастройкаСоставаУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>TG_НастройкаСоставаУведомлений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВкючатьВСостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TG_СоставОсновныхПолейЗадачиПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/TG_ОбъектыДляНастройкиСоставаОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>TG_ОбъектыДляНастройкиСоставаОповещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническийПроект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/TG_НастройкаСоставаУведомлений/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ТипОбъектаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипОбъектаПриИзмененииНаСервере()
	СоставОповещений.Очистить();
	Если ЭтотОбъект.ТипОбъекта = Перечисления.TG_ОбъектыДляНастройкиСоставаОповещений.ЗадачаПроцесса Тогда
		ЗаполнитьСоставОповещенийДляЗадачПроцесса();
	КонецЕсли; 	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставОповещений
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСоставОповещенийДляЗадачПроцесса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TG_СоставОсновныхПолейЗадачиПроцесса.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РеквизитыЗадачи
	|ИЗ
	|	Перечисление.TG_СоставОсновныхПолейЗадачиПроцесса КАК TG_СоставОсновныхПолейЗадачиПроцесса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыЗадачи.Ссылка КАК ИмяРеквизита,
	|	TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.ВкючатьВСостав КАК ВключатьВСостав
	|ИЗ
	|	РеквизитыЗадачи КАК РеквизитыЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса КАК TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса
	|		ПО РеквизитыЗадачи.Ссылка = TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.РеквизитОбъекта
	|			И (TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.Сотрудник = &Сотрудник)";
	
	
	Запрос.УстановитьПараметр("Сотрудник", Пользователи.ТекущийПользователь());
	ЭтотОбъект.СоставОповещений.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	НаборЗаписей = РегистрыСведений.TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Значение = ТекущийПользователь;
	НаборЗаписей.Отбор.Сотрудник.Использование = Истина;
	
	Для каждого Строка Из СоставОповещений Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Сотрудник = ТекущийПользователь;
		НоваяСтрока.РеквизитОбъекта = Строка.ИмяРеквизита;
		НоваяСтрока.ВкючатьВСостав = Строка.ВключатьВСостав;
	КонецЦикла; 
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись персональных настроек'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Попытка
		СохранитьНаСервере();
	Исключение
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(,НСтр("ru = 'Операция не может быть выполнена по причине:'") + Символы.ПС + ТекстСообщения);
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Попытка
		СохранитьНаСервере();
	Исключение
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(,НСтр("ru = 'Операция не может быть выполнена по причине:'") + Символы.ПС + ТекстСообщения);
		Возврат;
	КонецПопытки; 	
	Закрыть();
КонецПроцедуры
 
#КонецОбласти
